; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob2666) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 - Waypoint
	camera0 camera1 camera2 camera3 camera4 - Camera
	objective0 - Objective
	)
(:init
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint0)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint3)
	(visible waypoint3 waypoint1)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint1)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint2)
	(visible waypoint2 waypoint4)
	(visible waypoint4 waypoint2)
	(visible waypoint4 waypoint1)
	(visible waypoint1 waypoint4)
	(visible waypoint5 waypoint0)
	(visible waypoint0 waypoint5)
	(visible waypoint5 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint3)
	(visible waypoint3 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint5)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint1)
	(at_soil_sample waypoint2)
	(at_rock_sample waypoint2)
	(at_soil_sample waypoint3)
	(at_rock_sample waypoint3)
	(at_soil_sample waypoint5)
	(at_lander general waypoint0)
	(channel_free general)
	(at rover0 waypoint0)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_rock_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint0 waypoint1)
	(can_traverse rover0 waypoint1 waypoint0)
	(can_traverse rover0 waypoint0 waypoint2)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint4)
	(can_traverse rover0 waypoint4 waypoint0)
	(can_traverse rover0 waypoint0 waypoint5)
	(can_traverse rover0 waypoint5 waypoint0)
	(can_traverse rover0 waypoint1 waypoint3)
	(can_traverse rover0 waypoint3 waypoint1)
	(at rover1 waypoint4)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_soil_analysis rover1)
	(equipped_for_rock_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint4 waypoint0)
	(can_traverse rover1 waypoint0 waypoint4)
	(can_traverse rover1 waypoint4 waypoint1)
	(can_traverse rover1 waypoint1 waypoint4)
	(can_traverse rover1 waypoint0 waypoint2)
	(can_traverse rover1 waypoint2 waypoint0)
	(can_traverse rover1 waypoint2 waypoint3)
	(can_traverse rover1 waypoint3 waypoint2)
	(can_traverse rover1 waypoint2 waypoint5)
	(can_traverse rover1 waypoint5 waypoint2)
	(on_board camera0 rover1)
	(calibration_target camera0 objective0)
	(supports camera0 high_res)
	(supports camera0 low_res)
	(on_board camera1 rover0)
	(calibration_target camera1 objective0)
	(supports camera1 colour)
	(on_board camera2 rover0)
	(calibration_target camera2 objective0)
	(supports camera2 colour)
	(on_board camera3 rover1)
	(calibration_target camera3 objective0)
	(supports camera3 colour)
	(supports camera3 high_res)
	(on_board camera4 rover1)
	(calibration_target camera4 objective0)
	(supports camera4 colour)
	(supports camera4 high_res)
	(supports camera4 low_res)
	(visible_from objective0 waypoint0)
	(visible_from objective0 waypoint2)
	(visible_from objective0 waypoint4)
)

(:goal (and
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint1)
(communicated_rock_data waypoint1)
(communicated_rock_data waypoint2)
(communicated_rock_data waypoint3)
(communicated_image_data objective0 colour)
(communicated_image_data objective0 low_res)
(communicated_image_data objective0 high_res)
	)
)
)

; plan
1. (calibrate rover1 camera0 objective0 waypoint4)
   added: (calibrated camera0 rover1)
   goals met: 0 of 8
2. (take_image rover1 waypoint4 objective0 camera0 high_res)
   deleted: (calibrated camera0 rover1)
   added: (have_image rover1 objective0 high_res)
   goals met: 0 of 8
3. (navigate rover1 waypoint4 waypoint0)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint0)
   goals met: 0 of 8
4. (navigate rover1 waypoint0 waypoint2)
   deleted: (at rover1 waypoint0)
   added: (at rover1 waypoint2)
   goals met: 0 of 8
5. (sample_rock rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_rock_sample waypoint2)
   added: (have_rock_analysis rover1 waypoint2) (full rover1store)
   goals met: 0 of 8
6. (navigate rover1 waypoint2 waypoint3)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint3)
   goals met: 0 of 8
7. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 8
8. (sample_soil rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_soil_sample waypoint3)
   added: (have_soil_analysis rover1 waypoint3) (full rover1store)
   goals met: 0 of 8
9. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 8
10. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (have_rock_analysis rover1 waypoint3) (full rover1store)
   goals met: 0 of 8
11. (navigate rover1 waypoint3 waypoint2)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint2)
   goals met: 0 of 8
12. (communicate_soil_data rover1 general waypoint3 waypoint2 waypoint0)
   added: (communicated_soil_data waypoint3)
   goals met: 1 of 8
13. (communicate_rock_data rover1 general waypoint3 waypoint2 waypoint0)
   added: (communicated_rock_data waypoint3)
   goals met: 2 of 8
14. (communicate_rock_data rover1 general waypoint2 waypoint2 waypoint0)
   added: (communicated_rock_data waypoint2)
   goals met: 3 of 8
15. (communicate_image_data rover1 general objective0 high_res waypoint2 waypoint0)
   added: (communicated_image_data objective0 high_res)
   goals met: 4 of 8
16. (calibrate rover1 camera0 objective0 waypoint2)
   added: (calibrated camera0 rover1)
   goals met: 4 of 8
17. (calibrate rover0 camera1 objective0 waypoint0)
   added: (calibrated camera1 rover0)
   goals met: 4 of 8
18. (take_image rover0 waypoint0 objective0 camera1 colour)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective0 colour)
   goals met: 4 of 8
19. (navigate rover0 waypoint0 waypoint1)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint1)
   goals met: 4 of 8
20. (communicate_image_data rover0 general objective0 colour waypoint1 waypoint0)
   added: (communicated_image_data objective0 colour)
   goals met: 5 of 8
21. (sample_rock rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_rock_sample waypoint1)
   added: (have_rock_analysis rover0 waypoint1) (full rover0store)
   goals met: 5 of 8
22. (communicate_rock_data rover0 general waypoint1 waypoint1 waypoint0)
   added: (communicated_rock_data waypoint1)
   goals met: 6 of 8
23. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 6 of 8
24. (sample_soil rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_soil_sample waypoint1)
   added: (have_soil_analysis rover0 waypoint1) (full rover0store)
   goals met: 6 of 8
25. (communicate_soil_data rover0 general waypoint1 waypoint1 waypoint0)
   added: (communicated_soil_data waypoint1)
   goals met: 7 of 8
26. (take_image rover1 waypoint2 objective0 camera0 low_res)
   deleted: (calibrated camera0 rover1)
   added: (have_image rover1 objective0 low_res)
   goals met: 7 of 8
27. (communicate_image_data rover1 general objective0 low_res waypoint2 waypoint0)
   added: (communicated_image_data objective0 low_res)
   goals met: 8 of 8
